GIT - это распределенная система контроля версий (СКВ)
Это система для отслеживания и ведения истории изменений ваших файлов или проекта.

Репозиторий - хранилище ваших файлов которые вы отслеживаете при помощи гита, и их изменений.

Команды GIT:  

1. GIT init - онв создвет новый гит репозиторий локально на вашем пкб, создаст она в той директории где вы запускаете эту команду.

2. GIT add - когда мы создаем и изменяем файлы то при помощи этой коианды мы загружаем все изменения в промежуточное место хранение

git add <file_name>
git add . -> все в текущей директории

3. git commit - как только мы достигаем определенного момента в разработке, то мы тогда сохраняем и комментируем все наши изменения в репизиторий.
(фиксация изменений в репо.)

git commit -m '<commment>'















